
## Plan Result (aat)




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_container.client_containers[13]
  * azurerm_storage_container.client_containers_stg[13]
  * azurerm_storage_container.client_rejected_containers[13]
  * azurerm_storage_container.client_rejected_containers_stg[13]
* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_container.client_containers[13] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanaat"
    }

  # azurerm_storage_container.client_containers_stg[13] will be created
  + resource "azurerm_storage_container" "client_containers_stg" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanaatstaging"
    }

  # azurerm_storage_container.client_rejected_containers[13] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanaat"
    }

  # azurerm_storage_container.client_rejected_containers_stg[13] will be created
  + resource "azurerm_storage_container" "client_rejected_containers_stg" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanaatstaging"
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.Resources/deployments/Reform_Scan"
        name                = "Reform_Scan"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":142,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->